mithunbabbira/fleet_manager/firmware_v2/master/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
# CONFIG_BT_ENABLED is not set
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_DEFAULT is not set

#
# === Fleet URLs (edit HERE only — baked into bin; not NVS) ===
# Same for every device. Change → rebuild → publish OTA.
# Per-device: device_id / node_id / ota_token / ota_user via USB CLI.
#
CONFIG_OTA_CLOUD_CHECK_URL="https://api.trafyn.info/workflow-engine/realm/1/user/1/v1/execution/service/runWithNoAuth/get-latest-device-firmware?refreshCache=true"
# Trafyn fleet uplink (bare JSON array; no Vehicle wrap)
CONFIG_UPLINK_URL="https://api.trafyn.info/nc-events-api/v1/sources/nc-fleet-device/messages"
# CONFIG_UPLINK_VEHICLE_WRAP is not set
CONFIG_UPLINK_DEVICE_TYPE_OBD="obd"
CONFIG_UPLINK_DEVICE_TYPE_GPS="gps"

# PCB-frozen LTE UART (do not swap)
CONFIG_LTE_ENABLE=y
CONFIG_LTE_UART_TX_GPIO=16
CONFIG_LTE_UART_RX_GPIO=17
CONFIG_LTE_APN="airtelgprs.com"
# M2: modem GNSS (lat/lng + GPS UTC backup for wall clock)
CONFIG_LTE_GPS_ENABLE=y

CONFIG_OTA_CLOUD_AUTO_CHECK=y
CONFIG_OTA_CLOUD_AUTO_WAIT_SEC=90
CONFIG_OTA_CLOUD_AUTO_INTERVAL_MIN=30
# Leave auth empty in git — set via USB: ota_token / ota_user
CONFIG_OTA_CLOUD_AUTH_HEADER=""
CONFIG_OTA_CLOUD_SYSTEM_USER_ID=""

# M3: telemetry uplink tick
CONFIG_UPLINK_TICK_SEC=30

# M5: Zigbee coordinator + dynamic hosts → 1088
CONFIG_FLEET_ZIGBEE_ENABLE=y
CONFIG_FLEET_ZIGBEE_CHANNEL=15
CONFIG_FLEET_ZIGBEE_EPAN_ID="F1EE700000000001"
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZCZR=y

# M6: microSD store-on-fail (SPI2 pins frozen)
CONFIG_STORE_SD_ENABLE=y
CONFIG_STORE_SD_SCK_GPIO=4
CONFIG_STORE_SD_MOSI_GPIO=5
CONFIG_STORE_SD_MISO_GPIO=6
CONFIG_STORE_SD_CS_GPIO=18
